{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "CE",
    "1": "ENV",
    "2": "BME",
    "3": "PE",
    "4": "METAL",
    "5": "ME",
    "6": "EE",
    "7": "CPE",
    "8": "OPTIC",
    "9": "NANO",
    "10": "CHE",
    "11": "MATENG",
    "12": "AGRI",
    "13": "EDU",
    "14": "IE",
    "15": "SAFETY",
    "16": "MATH",
    "17": "MATSCI"
  },
  "initializer_range": 0.02,
  "label2id": {
    "AGRI": 12,
    "BME": 2,
    "CE": 0,
    "CHE": 10,
    "CPE": 7,
    "EDU": 13,
    "EE": 6,
    "ENV": 1,
    "IE": 14,
    "MATENG": 11,
    "MATH": 16,
    "MATSCI": 17,
    "ME": 5,
    "METAL": 4,
    "NANO": 9,
    "OPTIC": 8,
    "PE": 3,
    "SAFETY": 15
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "multi_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.38.1",
  "vocab_size": 30522
}
